import { Component, OnInit } from '@angular/core';
import { Router } from '@angular/router';
import { FormGroup, FormControl, Validators, FormBuilder }  from '@angular/forms';
import { AuthenticationService } from '../services/login.service';
import {Observable} from 'rxjs/Rx';

@Component({
  selector: 'app-set1',
  templateUrl: './set1.html',
  styleUrls: ['./set1.css']
})


export class Set1Component implements OnInit {
    
   ticks =0;
  i :number;
  answers = [ 'കസ്റ്റമര്‍ക്ക് ഇഷ്ടമുള്ളപ്പോള്‍', 'ക്ഷേമയോടെ കേട്ടിരിക്കും', 
             'എല്ലായ്പ്പോഴും മികച്ച ഉപഭോക്ത സേവനം നല്‍കണം ഇല്ലങ്കില്‍ പരാചയപ്പെടാം',
  'അരിത്‌മെറ്റിക്‌ ആൻഡ്  ലോജിക് യൂണിറ്റ്','ഓപ്പറേറ്റിംഗ് സിസ്റ്റം','സിസ്റ്റം ചേസിസ്','എ റ്റി എക്സ്','ആർ ജെ 45',
             'എസ്‌ എം റ്റി പി','ATX / എ റ്റി  എക്സ്','കസ്ടമര്‍ റിലേഷന്‍ഷിപ്‌ മാനേജ്മെന്റ്','ഇവയെല്ലാം',
             'അന്യ മതങ്ങളില്‍ പെട്ടവരുമായി സംസാരിക്കാതിരിക്കുന്നത്','കൂട്ടുകാരന്‍റെ സഹായത്തോടെ സ്ഥലം സന്ദര്‍ശിക്കും',
            'പുതിയ ഉല്പന്നം പരിചയപ്പെടുത്താന്‍','പ്രോഡക്റ്റ് മാന്വൽ','സിസ്റ്റത്തിലേക്കു പുതിയ ഗ്രാഫിക്സ് കാർഡ്  ചേർക്കും',
             'ഫോൺ കോളിന്റെ ദൈർഘ്യ൦','ഇവയെല്ലാം','സർവീസിനെ സംമ്മന്ധിച്ചുള്ള വിവരങ്ങൾ വെളിപ്പെടുത്താതിരിക്കുന്നതു',
            'ഡാറ്റാ ലിങ്ക്  ലയർ','അറ്റുനേഷൻ','സെഷൻ ലയർ','32',];
   favoriteSeason: string[]=[];
  qes: number ;
     total : number = 0;
  
   seasons0 = [  'രാവിലെ','രാത്രി','കസ്റ്റമര്‍ക്ക് ഇഷ്ടമുള്ളപ്പോള്‍', 'ഉച്ചയ്ക്ക് ശേഷം' ];
  seasons1 = [  'ക്ഷേമയോടെ കേട്ടിരിക്കും','ദേഷ്യപ്പെട്ടു ഇറങ്ങി പോകും','കസ്റ്റമറോട് ദേഷ്യപ്പെടും', 'സൂപ്പെര്‍വൈസറിനോട് പരാതി പറയും' ];
  seasons2 = [ 'മോശം ഉപഭോക്ത സേവനത്തിലുടെ നഷ്ട്ടപ്പെടുന്ന ഉപഭോക്താക്കളെ തിരിച്ചുവരുത്താന്‍ എളുപ്പമാണ്','ഉപഭോക്ത്ത സേവനം ബോറിംഗ് ആണ്',
   'ശരാശരി ഉപഭോക്ത സേവനം തന്നെ ധാരാളം ആണ്','എല്ലായ്പ്പോഴും മികച്ച ഉപഭോക്ത സേവനം നല്‍കണം ഇല്ലങ്കില്‍ പരാചയപ്പെടാം'];
  seasons3 = ['ഡിസ്ക്ക് യുണിറ്റ്','കണ്ട്രോള്‍ യുണിറ്റ്','അരിത്‌മെറ്റിക്‌ ആൻഡ്  ലോജിക് യൂണിറ്റ്','മോഡം'];  
  seasons4 = ['ഓപ്പറേറ്റിംഗ് സിസ്റ്റം','ഗ്രാഫിക് പ്രോഗ്രാം','വേഡ് പ്രോസസ്സിംഗ്','ഡാറ്റാബേസ് പ്രോഗ്രാം'];  
  seasons5 = ['സിസ്റ്റം റോം','പവർ സപ്ലൈ','സിസ്റ്റം ചേസിസ്','വീഡീയോ കാർഡ്'];
  seasons6 = ['എ റ്റി','എ റ്റി എക്സ്','ബി റ്റി','ഇവയെല്ലാം'];
  seasons7 = ['കോം 11','ആർ ജെ 45','ആർ ജെ 11','ഇതൊന്നും അല്ല'];
  seasons8 = ['എസ് എൻ എം പി','എഫ് റ്റി പി','എസ്‌ എം റ്റി പി','ആർ പി  സി'];
  seasons9 = ['ISA / ഐ എസ് എ','PCI / പി സി ഐ ', 'AGP / എ ജി പി', 'ATX / എ റ്റി  എക്സ്'];
  seasons10 =['കസ്റമര്‍ റെയിലറി മാറ്റര്‍','കറന്റ് റിമംബര്‍ മാച്ച്','കസ്ടമര്‍ റിലേഷന്‍ഷിപ്‌ മാനേജ്മെന്റ്','കസ്ടമര്‍ റുടിമെന്റലി മാനെജ്മെന്റ്'];
   seasons11 = ['സമർപ്പണം','ബഹുമാനം','പ്രൊഫഷണലിസം','ഇവയെല്ലാം'];
  seasons12 = ['ജോലിയില്‍ മറ്റുള്ളവരെ സഹായിക്കുന്നത്','കൃത്യ സമയം പാലിക്കുന്നത്', 'കസ്റ്റമറെ ബഹുമാനിക്കുന്നത്', 'അന്യ മതങ്ങളില്‍ പെട്ടവരുമായി സംസാരിക്കാതിരിക്കുന്നത്'];
  seasons13 = ['കൂട്ടുകാരന്‍റെ സഹായത്തോടെ സ്ഥലം സന്ദര്‍ശിക്കും','കൂട്ടുകാരന്‍റെ വീട്ടില്‍ സമയം ചിലവിട്ട് തിരിച്ചു വരും',
               'കൂട്ടുകരനോമോത്ത് സിനിമയ്ക്ക് പോകും','സ്ഥലം സന്ദര്‍ശിക്കുന്നത് വേണ്ടന്നു വെക്കും'];
  
   seasons14 = ['കൂടുതല്‍ പണം ആവശ്യപ്പെടാന്‍','മറന്നുപോയ ടൂള്‍സ് തിരികെ ലഭിക്കാന്‍','പുതിയ ഉല്പന്നം പരിചയപ്പെടുത്താന്‍',
                'വാറണ്ടി കാര്‍ഡ്‌ തിരിച്ചു വാങ്ങിക്കാന്‍'];
  
    seasons15 = ['സർവീസ് ബില്ല്','വാറണ്ടി','പ്രോഡക്റ്റ് മാന്വൽ',
                'പ്രോഡക്റ്റ് അഡ്വെർടൈസ്‌മെന്റ്'];
  
    seasons16 = ['സിസ്റ്റത്തിലേക്കു പുതിയ പവർ സപ്ലൈ ചേർക്കും','സിസ്റ്റത്തിലേക്കു പുതിയ റാം  ചേർക്കും','സിസ്റ്റത്തിലേക്കു പുതിയ ഗ്രാഫിക്സ് കാർഡ്  ചേർക്കും',
                'സിസ്റ്റത്തിലേക്കു പുതിയ പ്രോസസ്സർ ചേർക്കും'];
  
    seasons17 = ['കസ്റ്റമറുടെ പേര്','ഫോൺ കോളിന്റെ ദൈർഘ്യ൦','കസ്റ്റമറുടെ ഫോൺ നമ്പർ',
                'ഫോൺ കാൾ വന്ന സമയം'];
  
    seasons18 = ['സംഘടനാ  മാനദണ്ഡങ്ങൾ','സംഘടയലുള്ള ആചാരങ്ങളും ചടങ്ങുകളും','പൊതുവായ ഭാഷ   ഉപയോഗിക്കുന്നത്',
                'ഇവയെല്ലാം'];
  
  
    seasons19 = ['കസ്റ്റമറോട് മര്യാദയായി പെരുമാറുന്നത്','സർവീസിനെ സംമ്മന്ധിച്ചുള്ള വിവരങ്ങൾ വെളിപ്പെടുത്താതിരിക്കുന്നതു',
                 'സർവീസിനെ സംമ്മന്ധിച്ചുള്ള ഫീഡ് ബാക്ക് ചോദിക്കുന്നത്','ഇതൊന്നും അല്ല'];
  
   
    seasons20 = ['ഫിസിക്കൽ ലയർ','ഡാറ്റാ ലിങ്ക്  ലയർ',
                 'നെറ്റ്‌വർക്ക് ലയർ','ഇതൊന്നും അല്ല'];

    seasons21 = ['കംപ്രഷൻ','അറ്റുനേഷൻ',
                 'സാച്ചുറേഷൻ','ഇതൊന്നും അല്ല'];
  
  
    seasons22 = ['ഡാറ്റാ ലിങ്ക് ലയർ','നെറ്റ്‌വർക്ക് ലയർ','സെഷൻ ലയർ','ഇതൊന്നും അല്ല'];
  
  
    seasons23 = ['8','16','32','48'];
  
  
    seasons24 = ['കസ്റ്റമറോട് മര്യാദയായി പെരുമാറുന്നത്','സർവീസിനെ സംമ്മന്ധിച്ചുള്ള വിവരങ്ങൾ വെളിപ്പെടുത്താതിരിക്കുന്നതു',
                 'സർവീസിനെ സംമ്മന്ധിച്ചുള്ള ഫീഡ് ബാക്ക് ചോദിക്കുന്നത്','ഇതൊന്നും അല്ല'];
  
  
    seasons25 = ['കസ്റ്റമറോട് മര്യാദയായി പെരുമാറുന്നത്','സർവീസിനെ സംമ്മന്ധിച്ചുള്ള വിവരങ്ങൾ വെളിപ്പെടുത്താതിരിക്കുന്നതു',
                 'സർവീസിനെ സംമ്മന്ധിച്ചുള്ള ഫീഡ് ബാക്ക് ചോദിക്കുന്നത്','ഇതൊന്നും അല്ല'];
  
  
    seasons26 = ['കസ്റ്റമറോട് മര്യാദയായി പെരുമാറുന്നത്','സർവീസിനെ സംമ്മന്ധിച്ചുള്ള വിവരങ്ങൾ വെളിപ്പെടുത്താതിരിക്കുന്നതു',
                 'സർവീസിനെ സംമ്മന്ധിച്ചുള്ള ഫീഡ് ബാക്ക് ചോദിക്കുന്നത്','ഇതൊന്നും അല്ല'];
  
   
    seasons27 = ['കസ്റ്റമറോട് മര്യാദയായി പെരുമാറുന്നത്','സർവീസിനെ സംമ്മന്ധിച്ചുള്ള വിവരങ്ങൾ വെളിപ്പെടുത്താതിരിക്കുന്നതു',
                 'സർവീസിനെ സംമ്മന്ധിച്ചുള്ള ഫീഡ് ബാക്ക് ചോദിക്കുന്നത്','ഇതൊന്നും അല്ല'];
   
   
    seasons28 = ['കസ്റ്റമറോട് മര്യാദയായി പെരുമാറുന്നത്','സർവീസിനെ സംമ്മന്ധിച്ചുള്ള വിവരങ്ങൾ വെളിപ്പെടുത്താതിരിക്കുന്നതു',
                 'സർവീസിനെ സംമ്മന്ധിച്ചുള്ള ഫീഡ് ബാക്ക് ചോദിക്കുന്നത്','ഇതൊന്നും അല്ല'];
  
  
  
  constructor( private router: Router,  private As: AuthenticationService) {   }
  ngOnInit()  {
   let timer = Observable.timer(2000,1000);
          timer.subscribe(t=> {
        this.func(t);
  });
    this.qes = 1;
  }
  func(c:any)
  {
    this.ticks = c;
    if (this.ticks == 720)
    {
      this.res();
    }

  }
 login() {
   
   console.log('insisi');
   
 }
  next()
  {  
    this.qes++
  }
  prev()
  {  
    this.qes = this.qes-1;
  }
  res()
  {
     console.log(this.favoriteSeason);
                              this.total=0;
                           for(this.i=0;this.i<20;this.i++)
                           {

                             console.log(this.answers[this.i]);
                             console.log(this.favoriteSeason[this.i]);
                              if(this.answers[this.i] === this.favoriteSeason[this.i])
                              {
                                this.total++;
                              }
                           }

   
     this.As.col_tot(this.total);
      
      this.router.navigate(['/end']);

  }


  }
